In [30]:
#Import dependencies
import pandas as pd

#Import modules
from sqlalchemy import create_engine

In [31]:
#Load CSV files
clean_inspection = "Resources/clean_inspection_df2.csv"
clean_income = "Resources/clean_income_df2.csv"

In [32]:

#View inspection dataframe
clean_inspection_df = pd.read_csv(clean_inspection)
clean_inspection_df.head()

,DBA,Borough,STREET,CUISINE DESCRIPTION,SCORE,GRADE,GRADE DATE
0,HENRI'S BACKYARD,BROOKLYN,4TH AVE,American,39.0,C,06/22/2017
1,RICHMOND COUNTY COUNTRY CLUB,STATEN ISLAND,TODT HILL ROAD,American,12.0,A,06/14/2017
2,TOMOE SUSHI,MANHATTAN,THOMPSON STREET,Japanese,13.0,A,10/06/2015
3,CRAB SPOT RESTAURANT,BROOKLYN,UNION STREET,Seafood,12.0,A,07/28/2016
4,M NOODLE SHOP,BROOKLYN,METROPOLITAN AVENUE,Chinese,10.0,A,01/19/2017

In [33]:
#Rename columns
clean_inspection_df.rename(columns = {'CUISINE DESCRIPTION':'CUISINE_DESCRIPTION', 'GRADE DATE': 'GRADE_DATE'}, inplace = True)

In [34]:
#View income dataframe
clean_income_df = pd.read_csv(clean_income)
clean_income_df.head()

  INCOME LEVEL                              DBA            STREET
0  high income            MARIACHI'S RESTAURANT   CHAMBERS STREET
1  high income            SPOTIFY - BARISTA BAR  GREENWICH STREET
2  high income  STARBUCKS COFFEE COMPANY #29854  GREENWICH STREET
3  high income                          CANTEEN   WORLD TRADE CTR
4  high income     JOE & THE JUICE GREENWICH ST  GREENWICH STREET

In [35]:
#Rename columns
clean_income_df.rename(columns = {'INCOME LEVEL':'INCOME_LEVEL'}, inplace = True)

In [36]:
#Create database engine
"postgresql://[user]:[password]@[location]:[port]/[database]"

'postgresql://[user]:[password]@[location]:[port]/[database]'

In [37]:
#Import password from config.py file
from config import db_password

In [38]:
#Connection string for local server
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/NYC_restaurants"

In [39]:
#Create database engine
engine = create_engine(db_string)

In [40]:
#Import inspection data
clean_inspection_df.to_sql(name='inspection3', con=engine)

In [41]:
#Import income data
clean_income_df.to_sql(name='income3', con=engine)